controllers/UserController.php

SELECT 1 FROM `y_user` WHERE `username`='Grischuk_Sergeevich'
---
    public function actionRegistration(){

        $user = new User;
        $user->scenario = 'register';
        $profile = new Profile;

        $request = Yii::$app->request;
        if ($request->isAjax && $user->load($request->post()) && $profile->load($request->post())) {
            Yii::$app->response->format = \yii\web\Response::FORMAT_JSON;
            $errors = ActiveForm::validate($user, $profile);
            if(count($errors) != 0){
                echo json_encode($errors);
            } else {
                $user->username = \app\helpers\GenerateUsername::run($profile->first_name . '_' . $profile->last_name);