models/User.php

SELECT * FROM `y_user` WHERE `username`='Grischuk_Sergeevich'
---
    public function uniqueUsername( $username = null ){
        if($username == null) $username = $this->username;
        $user = self::find()->where(['username' => $username])->one();