models/User.php

    public function fields() {
        return [
            'id',
            'email',
            'firstName' => $this->profile->first_name,
            'lastName' => $this->profile->last_name,
            'fullName' => function ($model) {
                return $model->profile->first_name . ' ' . $model->profile->last_name;
            },
            'email_confirm_token',
            'auth_key',
            'status'
        ];
---
SELECT * FROM `y_profile` WHERE 0=1